src/cf/Catalogs/РегистрыПравил.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>РегистрыПравил</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСоответствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокВыбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кэш</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Системный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязиПараметровВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/РегистрыПравил/Forms/ФормаТестированияПравил/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьТипЯчейкиПоУмолчанию(СтрокаТаблицыЗначений)
	МассивТипов=СтрокаТаблицыЗначений.ОписаниеТипов.Типы();
	Если МассивТипов.Количество()>1 Тогда Возврат; КонецЕсли;
	ТипПоУмолчанию=МассивТипов[0];

	Если СокрЛП(ТипПоУмолчанию)="Число" Тогда
		СтрокаТаблицыЗначений.Значение=0;
	ИначеЕсли СокрЛП(ТипПоУмолчанию)="Строка" Тогда
		СтрокаТаблицыЗначений.Значение="";
	ИначеЕсли СокрЛП(ТипПоУмолчанию)="Дата" Тогда
		СтрокаТаблицыЗначений.Значение=Дата('00010101');
	ИначеЕсли СокрЛП(ТипПоУмолчанию)="Булево" Тогда
		СтрокаТаблицыЗначений.Значение=Ложь;
	Иначе
		СтрокаТаблицыЗначений.Значение=Новый(ТипПоУмолчанию);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Основные действия

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	Если Команда.Имя="ВыполнитьТестирование" Тогда
		ВыполнитьТестирование();

	ИначеЕсли Команда.Имя="ЗаполнитьПоДаннымОбъекта" Тогда
		ЗаполнитьПоДаннымОбъекта();

	ИначеЕсли Команда.Имя="ЗаполнитьПоФормулам" Тогда
		ЗаполнитьПоФормулам();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымОбъекта()
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда Возврат; КонецЕсли; 
	//Если РегистрПравил=Справочники.РегистрыПравил.УстановкаДатыЗапретаРедактирования Тогда
	//	тзИзмерения=РеквизитФормыВЗначение("Измерения");

	//	СтрокаТабличнойЧасти=тзИзмерения.Найти(Справочники.РегистрыПравил.УстановкаДатыЗапретаРедактирования_Измерения_Пользователь, "Параметр");
	//	СтрокаТабличнойЧасти.Значение=ПараметрыСеанса.ТекущийПользователь;

	//	СтрокаТабличнойЧасти=тзИзмерения.Найти(Справочники.РегистрыПравил.УстановкаДатыЗапретаРедактирования_Измерения_ВидДокумента, "Параметр");
	//	СтрокаТабличнойЧасти.Значение=СсылкаНаОбъект.Метаданные().Имя;

	//	ЗначениеВРеквизитФормы(тзИзмерения, "Измерения");
	//КонецЕсли;
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьПоФормулам()
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		СтруктураПараметров=Новый Структура;
		СтруктураПараметров.Вставить("Объект", СсылкаНаОбъект);
	КонецЕсли;
	Для каждого СтрокаТабличнойЧасти Из Измерения Цикл
		Атрибут=СтрокаТабличнойЧасти.Параметр;
		Если НЕ ТипЗнч(Атрибут)=Тип("СправочникСсылка.РегистрыПравил") Тогда Продолжить; КонецЕсли; 
		ЗначениеИзмерения=Неопределено; 
		Попытка Выполнить(Атрибут.ТекстМодуля);
		Исключение Сообщить(ОписаниеОшибки());
		КонецПопытки;
		Если ЗначениеИзмерения=Неопределено Тогда Продолжить; КонецЕсли; 
		СтрокаТабличнойЧасти.Значение=ЗначениеИзмерения;
	КонецЦикла;
КонецПроцедуры
 
&НаСервере
Процедура ВыполнитьТестирование()
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("Отказ", Ложь);
	СтруктураПараметров.Вставить("РежимТестирования", Истина);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		СтруктураПараметров.Вставить("Объект", СсылкаНаОбъект.ПолучитьОбъект());
	КонецЕсли;
	
	СтруктураРегистраПравил=Справочники.РегистрыПравил.Инициализация(РегистрПравил);
	
	Для Каждого СтрокаТабличнойЧасти Из Измерения Цикл
		Параметр=СтрокаТабличнойЧасти.Параметр;
		Если ТипЗнч(Параметр)=Тип("Строка") Тогда
			стрИмя=Параметр;
		Иначе
			стрИмя=Параметр.Код;
		КонецЕсли;
		СтруктураПараметров.Вставить(стрИмя, СтрокаТабличнойЧасти.Значение);
	КонецЦикла;

	Результат=Новый Структура; тзИзмерения=РеквизитФормыВЗначение("Измерения");

	Если РегистрПравил.Код="СклонениеСлов" Тогда
		СтрокаТабличнойЧасти=тзИзмерения.Найти(Справочники.РегистрыПравил.НайтиПоКоду("СклонениеСлов_Род"), "Параметр");
		Род=СтрокаТабличнойЧасти.Значение;
		
		СтрокаТабличнойЧасти=тзИзмерения.Найти(Справочники.РегистрыПравил.НайтиПоКоду("СклонениеСлов_КатегорияСлова"), "Параметр");
		КатегорияСлова=СтрокаТабличнойЧасти.Значение;
		
		СтрокаТабличнойЧасти=тзИзмерения.Найти("Слово", "Параметр");
		Слово=СтрокаТабличнойЧасти.Значение;

		Результат=Справочники.РегистрыПравил.ВыполнитьПравило_СклонениеСлов(Слово, Род, КатегорияСлова);		
	Иначе
		Для каждого СтрокаТаблицыЗначений Из СтруктураРегистраПравил.Измерения Цикл
			СтрокаТабличнойЧасти=тзИзмерения.Найти(СтрокаТаблицыЗначений.Объект, "Параметр");
			Если СтрокаТабличнойЧасти=Неопределено Тогда Продолжить; КонецЕсли; 
			СтрокаТаблицыЗначений.ЗначениеИзмерения=СтрокаТабличнойЧасти.Значение;
		КонецЦикла;
		Результат=Справочники.РегистрыПравил.ВыполнитьПравило(РегистрПравил, СтруктураПараметров,,СтруктураРегистраПравил);
	КонецЕсли;
	
	Ресурсы.Очистить();
	Для каждого СтрокаКоллекции Из Результат Цикл
		НоваяСтрока=Ресурсы.Добавить();	
		Если Лев(СтрокаКоллекции.Ключ, 2)="Д_" Тогда
			НоваяСтрока.Имя=Справочники.РегистрыПравил.АтрибутИзСтроки(СтрокаКоллекции.Ключ);
		Иначе
			НоваяСтрока.Имя=СтрокаКоллекции.Ключ;
		КонецЕсли;
		НоваяСтрока.Значение=СтрокаКоллекции.Значение;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура Инициализация()
	Измерения.Очистить(); Ресурсы.Очистить();
	Если РегистрПравил.Пустая() Тогда Возврат; КонецЕсли;

	СтруктураРегистраПравил=Справочники.РегистрыПравил.Инициализация(РегистрПравил);
	
	Если РегистрПравил.Код="СклонениеСлов" Тогда
		НоваяСтрока=Измерения.Добавить();
		НоваяСтрока.Параметр="Слово";
		НоваяСтрока.Значение="";
		НоваяСтрока.ОписаниеТипов=Новый ОписаниеТипов("Строка");
		
		НоваяСтрока=Измерения.Добавить();
		НоваяСтрока.Параметр=Справочники.РегистрыПравил.НайтиПоКоду("СклонениеСлов_Род");
		НоваяСтрока.Значение="";
		НоваяСтрока.ОписаниеТипов=Новый ОписаниеТипов("Строка");
		
		НоваяСтрока=Измерения.Добавить();
		НоваяСтрока.Параметр=Справочники.РегистрыПравил.НайтиПоКоду("СклонениеСлов_КатегорияСлова");
		НоваяСтрока.Значение="";
		НоваяСтрока.ОписаниеТипов=Новый ОписаниеТипов("Строка");
	Иначе //
		Для Каждого СтрокаТаблицыЗначений Из СтруктураРегистраПравил.Измерения Цикл
			НоваяСтрока=Измерения.Добавить();
			НоваяСтрока.Параметр=СтрокаТаблицыЗначений.Объект;
			Если СтрокаТаблицыЗначений.Объект.ТипСоответствия="СписокДанных" Тогда
				НоваяСтрока.ОписаниеТипов=Новый ОписаниеТипов("СписокЗначений");
			Иначе
				НоваяСтрока.ОписаниеТипов=СтрокаТаблицыЗначений.Объект.ОписаниеТипа.Получить();
			КонецЕсли;
			УстановитьТипЯчейкиПоУмолчанию(НоваяСтрока);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="РегистрПравил" Тогда
		Инициализация();
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РегистрПравил") Тогда
		РегистрПравил=Параметры.РегистрПравил;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Инициализация();
КонецПроцедуры
